; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v4 - type_2 ?v2 - type_3)
 	      (pred_1 ?v1 - object ?v2 - type_3)
	      (pred_3 ?v4 - type_2 ?v3 - type_1)
	      (pred_2 ?v4 - type_2 ?v1 - object ?v3 - type_1))

   (:action op_2
       :parameters  (?v4 - type_2 ?v6 ?v7 - type_3)
       :precondition (and  (pred_4 ?v4 ?v6))
       :effect (and  (pred_4 ?v4 ?v7)
		     (not (pred_4 ?v4 ?v6))))

   (:action op_1
       :parameters (?v4 - type_2 ?v8 - object ?v5 - type_3 ?v3 - type_1)
       :precondition  (and  (pred_1 ?v8 ?v5) (pred_4 ?v4 ?v5) (pred_3 ?v4 ?v3))
       :effect (and (pred_2 ?v4 ?v8 ?v3)
		    (not (pred_1 ?v8 ?v5)) 
		    (not (pred_3 ?v4 ?v3))))

   (:action op_3
       :parameters (?v4 - type_2 ?v8 - object ?v5 - type_3 ?v3 - type_1)
       :precondition  (and  (pred_2 ?v4 ?v8 ?v3) (pred_4 ?v4 ?v5))
       :effect (and (pred_1 ?v8 ?v5)
		    (pred_3 ?v4 ?v3)
		    (not (pred_2 ?v4 ?v8 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_10 obj_08 - type_2
obj_07 obj_13 obj_09 obj_12 - type_1
obj_11 obj_02 obj_14 obj_06 - type_3
obj_04 obj_05 obj_03 obj_01 - object)
(:init
(pred_4 obj_10 obj_02)
(pred_3 obj_10 obj_07)
(pred_3 obj_10 obj_13)
(pred_4 obj_08 obj_11)
(pred_3 obj_08 obj_09)
(pred_3 obj_08 obj_12)
(pred_1 obj_04 obj_11)
(pred_1 obj_05 obj_11)
(pred_1 obj_03 obj_02)
(pred_1 obj_01 obj_11)
)
(:goal
(and
(pred_1 obj_04 obj_14)
(pred_1 obj_05 obj_06)
(pred_1 obj_03 obj_02)
(pred_1 obj_01 obj_02)
)
)

(:constraints
  (always (not (pred_4 obj_10 obj_14)))
)
)

; plan
1. (op_1 obj_08 obj_04 obj_11 obj_12)
   deleted: (pred_1 obj_04 obj_11) (pred_3 obj_08 obj_12)
   added: (pred_2 obj_08 obj_04 obj_12)
   goals met: 1 of 4
2. (op_1 obj_08 obj_05 obj_11 obj_09)
   deleted: (pred_1 obj_05 obj_11) (pred_3 obj_08 obj_09)
   added: (pred_2 obj_08 obj_05 obj_09)
   goals met: 1 of 4
3. (op_2 obj_10 obj_02 obj_11)
   deleted: (pred_4 obj_10 obj_02)
   added: (pred_4 obj_10 obj_11)
   goals met: 1 of 4
4. (op_2 obj_08 obj_11 obj_06)
   deleted: (pred_4 obj_08 obj_11)
   added: (pred_4 obj_08 obj_06)
   goals met: 1 of 4
5. (op_1 obj_10 obj_01 obj_11 obj_13)
   deleted: (pred_1 obj_01 obj_11) (pred_3 obj_10 obj_13)
   added: (pred_2 obj_10 obj_01 obj_13)
   goals met: 1 of 4
6. (op_3 obj_08 obj_05 obj_06 obj_09)
   deleted: (pred_2 obj_08 obj_05 obj_09)
   added: (pred_1 obj_05 obj_06) (pred_3 obj_08 obj_09)
   goals met: 2 of 4
7. (op_2 obj_10 obj_11 obj_02)
   deleted: (pred_4 obj_10 obj_11)
   added: (pred_4 obj_10 obj_02)
   goals met: 2 of 4
8. (op_2 obj_08 obj_06 obj_14)
   deleted: (pred_4 obj_08 obj_06)
   added: (pred_4 obj_08 obj_14)
   goals met: 2 of 4
9. (op_3 obj_10 obj_01 obj_02 obj_13)
   deleted: (pred_2 obj_10 obj_01 obj_13)
   added: (pred_1 obj_01 obj_02) (pred_3 obj_10 obj_13)
   goals met: 3 of 4
10. (op_3 obj_08 obj_04 obj_14 obj_12)
   deleted: (pred_2 obj_08 obj_04 obj_12)
   added: (pred_1 obj_04 obj_14) (pred_3 obj_08 obj_12)
   goals met: 4 of 4
